In [1]:
%load_ext sql

# put a folder and DB credential files at HOME directory
import os
homedir = os.getcwd()
cred_path = os.path.join(homedir, 'db_cred')



# add a 'cred_path' for interpreter to search
import sys
sys.path.append(cred_path)



# import DB credentials from 'gpdb_credentials.py' dictionary file.
from gpdb_credentials import dvdrental_db



# parsing DB credentials and connect to Greenplum using %sql $connection_string

username = dvdrental_db['Username']
password = dvdrental_db['Password']
host = dvdrental_db['Host']
port = dvdrental_db['Port']
database = dvdrental_db['Database']

connection_string = 'postgresql://{user}:{password}@{host}:{port}/{db}'.format(
user=username,
password=password,
host=host,
port=port,
db=database)

%sql $connection_string

'Connected: myuser@dvdrental'

# Limit  절
---
- 기본적으로 특정 집합을 출력할 때 `출력되는 행의 수를 제한(limit)` 하는 기능을 한다.
- 부분 범위를 지정해서 출력하고자 할때 사용된다.
- limit절은 PostgreSQL, MySQL 등에서만 지원 된다.
- **실무에서 굉장히 많이 사용되는 문법이다.**

---
>1) 사용법 1 : 직접적으로 출력할 행의 수를 지정한다.
```python
select *
    from Table_Name
    limit N(숫자) # 출력하는 행의 수를 지정한다.
```    

>2) 사용법 2 : 출력하는 행의 수를 지정하고, 시작점을 지정한다.
```python
select *
    from Table_Name
    limit N offset M # N : 출력할 행의 수, M : 출력을 시작할 위치
```
- 이때 M값의 시작위치는 0이다.(아무것도 입력안하면 0이란 얘기)

---

Oracle 기반에서는 where절에 rownum 기능을 이용해 동일하게 적용가능 하다.

>오라클에서의 사용법 1)
```python
select *
    from Table_Name
    where rownum >= 10; # 1행부터 10행까지 출력
```

>오라클에서의 사용법 2)
```python
select *
    from Table_Name
    where rownum >= 10, 4; # 4번째 행부터 10건 출력
```

과 같이 사용할 수 있다.

# limit절 실습

## 1) 사용법 1 : 직접적으로 출력할 행의 수를 지정한다.
```python
select *
    from Table_Name
    limit N(숫자) # 출력하는 행의 수를 지정한다.
```

In [2]:
%%sql

select 
	film_id,
	title,
	release_year
from 
	film
order by film_id -- order by 한 결과 중에서  
limit 5; -- 5건만 출력

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(1, 'Academy Dinosaur', 2006),
 (2, 'Ace Goldfinger', 2006),
 (3, 'Adaptation Holes', 2006),
 (4, 'Affair Prejudice', 2006),
 (5, 'African Egg', 2006)]

In [3]:
%%sql

select 
	film_id,
	title,
	rental_rate
from 
	film
order by rental_rate desc -- rental_rate를 기준으로 값이 높은 순으로 정렬한 값중에 
limit 10; -- 10건만 출력

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(13, 'Ali Forever', Decimal('4.99')),
 (20, 'Amelie Hellfighters', Decimal('4.99')),
 (7, 'Airplane Sierra', Decimal('4.99')),
 (10, 'Aladdin Calendar', Decimal('4.99')),
 (2, 'Ace Goldfinger', Decimal('4.99')),
 (8, 'Airport Pollock', Decimal('4.99')),
 (98, 'Bright Encounters', Decimal('4.99')),
 (133, 'Chamber Italian', Decimal('4.99')),
 (384, 'Grosse Wonderful', Decimal('4.99')),
 (21, 'American Circus', Decimal('4.99'))]

In [4]:
%%sql

select 
	film_id,
	title,
	rental_rate
from 
	film
order by rental_rate -- rental_rate를 기준으로 값이 낮은 순으로 정렬한 값중에 
limit 5; -- 5건만 출력

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
5 rows affected.

[(12, 'Alaska Phantom', Decimal('0.99')),
 (213, 'Date Speed', Decimal('0.99')),
 (11, 'Alamo Videotape', Decimal('0.99')),
 (1, 'Academy Dinosaur', Decimal('0.99')),
 (14, 'Alice Fantasia', Decimal('0.99'))]

## 2) 사용법 2 : 출력하는 행의 수를 지정하고, 시작점을 지정한다.
```python
select *
    from Table_Name
    limit N offset M # N : 출력할 행의 수, M : 출력을 시작할 위치 (offset은 필수가 아님)
```
- 이때 M값의 시작위치는 0이다.(아무것도 입력안하면 0이란 얘기)

In [5]:
%%sql

select 
	film_id,
	title,
	release_year
from 
	film
order by film_id -- order by 한 결과 중에서 (asc 정렬)
limit 4 -- 4건만 출력한다.
	offset 3; -- 출력행의 시작위치는 3 (-- offset의 시작위치는 0이므로 0, 1, 2, 3 이어서 4번째 행부터 출력된다.)

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
4 rows affected.

[(4, 'Affair Prejudice', 2006),
 (5, 'African Egg', 2006),
 (6, 'Agent Truman', 2006),
 (7, 'Airplane Sierra', 2006)]

In [6]:
%%sql

select 
	film_id,
	title,
	release_year
from 
	film
order by film_id -- order by 한 결과 중에서  
limit 10 -- 10건만 출력하는데
offset 4; -- 5번째 행부터 출력 (0, 1, 2, 3, 4 이므로 )

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
10 rows affected.

[(5, 'African Egg', 2006),
 (6, 'Agent Truman', 2006),
 (7, 'Airplane Sierra', 2006),
 (8, 'Airport Pollock', 2006),
 (9, 'Alabama Devil', 2006),
 (10, 'Aladdin Calendar', 2006),
 (11, 'Alamo Videotape', 2006),
 (12, 'Alaska Phantom', 2006),
 (13, 'Ali Forever', 2006),
 (14, 'Alice Fantasia', 2006)]

- film_id로 order by한 것을 offset 없이 10건 출력한것과 비교하면 이해가 쉽다.

- 위의 결과를 보면 offset을 4로했을경우 출력된 film_id의 첫번째 번호는 4로 시작한다.